#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма)Экспорт 
	 
	 ИмяФормы = Форма.ИмяФормы;
	 
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"  Тогда 
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		 ДобавитьПолеСогласованнаяСкидкаИКомандаПересчет(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"  Тогда 
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	 ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"  Тогда 
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	 
	 ИначеЕсли ИмяФормы  = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		 ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма);
	 ИначеЕсли ИмяФормы  = "Документ.ОплатаПоставщикуФорма.ФормаДокумента" Тогда 
		 ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма);
	 КонецЕсли; 
	 
	 
 КонецПроцедуры


 Процедура  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	 
	 ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.ДТК_КонтактноеЛицо";
	 ПолеВвода.Заголовок = "Контактное лицо";  
	 
 КонецПроцедуры 



 Процедура  ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма) Экспорт 
	 
	 ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.ДТК_КонтактноеЛицо";
	 ПолеВвода.Заголовок = "Контактное лицо";
	 
 КонецПроцедуры 
 
 Процедура  ДобавитьПолеСогласованнаяСкидкаИКомандаПересчет(Форма) Экспорт
	 
	 // Создание общей группы для  поле формы  и для команды
	 Группа = Форма.Элементы.Добавить("ГруппаСкидкаПересчет",Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	 Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	 Группа.Отображение = ОтображениеОбычнойГруппы.Нет; 
	 Группа.ОтображатьЗаголовок = Ложь;
	 Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	 
	 //Создание поле ввода на форме  
	 ПолеСкидка = Форма.Элементы.Добавить("ДТК_СогласованнаяСкидка", Тип("ПолеФормы"), Группа);
	 ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеСкидка.ПутьКДанным ="Объект.ДТК_СогласованнаяСкидка";  
	 ПолеСкидка.Заголовок = "Скидка";
	 ПолеСкидка.УстановитьДействие("ПриИзменении", "ДТК_СогласованнаяСкидкаПриИзменении"); 
	 
	 //Создание команды  и кнопку на форме
	 Команда = Форма.Команды.Добавить("Пересчет");
	 Команда.Заголовок = "Пересчет"; 
	 Команда.Картинка = БиблиотекаКартинок.Обновить;  
	 Команда.Действие = "КомандаПересчитатьТаблицу";
     
	 КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчет",Тип("КнопкаФормы"), Группа);
	 КнопкаФормы.ИмяКоманды = "Пересчет"; 
	 КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	 КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	 
 КонецПроцедуры 
 
 
 
 #КонецОбласти
